#У вас есть две переменные:a = 10 b = "5"
#Напишите код, который преобразует переменную b к числовому типу, складывает a и b, и выводит результат на экран.
a=10
b="5"
b_int=int(b)
result=a+b_int
print(result)

#Объявите переменную с именем my_number и присвойте ей значение 15.
# Затем переопределите эту переменную, присвоив ей значение 25.
# Выведите значение переменной на экран после переопределения.
my_number=15
my_number=25
print(my_number)

#Напишите код, который сравнивает два числа: 8 и 12.
# Проверьте, является ли 8 меньше 12, и выведите результат сравнения (True или False) на экран.
number_1=8
number_2=12
print(number_1<number_2)

#Объявите три переменные разных типов данных:
#Целое число со значением 100
#Строку с вашим именем
#Дробное число со значением 3.14
#Выведите значения всех трёх переменных на экран.
variable_1 = 100
variable_2 = "Татьяна"
variable_3 = 3.14
print(variable_1,variable_2,variable_3)

#Напишите код, который выполняет следующие арифметические операции с числами 20 и 4:
#Сложение Вычитание Умножение Деление
#Выведите результаты всех четырёх операций на экран.
number_1 = 20
number_2 = 4
result = number_1 + number_2
print(result)
result = number_1 - number_2
print(result)
result = number_1 * number_2
print(result)
result = number_1 / number_2
print(result)






